In [2]:
import numpy as np
import pandas as pd

In [3]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961]
    
]

In [4]:
df = pd.DataFrame(marvel_data)
df

                 0     1     2
0       Spider-Man  male  1962
1  Captain America  male  1941
2        Wolverine  male  1974
3         Iron Man  male  1963
4             Thor  male  1963
5            Thing  male  1961

In [5]:
df.columns = ['name', 'sex', 'first_appearance']
df

              name   sex  first_appearance
0       Spider-Man  male              1962
1  Captain America  male              1941
2        Wolverine  male              1974
3         Iron Man  male              1963
4             Thor  male              1963
5            Thing  male              1961

In [6]:
mask = df['first_appearance'] > df.loc[0, 'first_appearance']

In [7]:
df[mask]

        name   sex  first_appearance
2  Wolverine  male              1974
3   Iron Man  male              1963
4       Thor  male              1963

In [17]:
df[['name','sex']]

              name   sex
0       Spider-Man  male
1  Captain America  male
2        Wolverine  male
3         Iron Man  male
4             Thor  male
5            Thing  male

In [1]:
s = ['a', 'b', 'c', 'd', 'e']
s[::-1]

['e', 'd', 'c', 'b', 'a']

In [3]:
import numpy as np

li = [1, 2, 3, 4, 5, 6, 7, 8, 9]

arr = np.array(li).reshape(3,3)
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [4]:
mean_ax0 = arr.mean(axis=0)
mean_ax0

array([4., 5., 6.])

In [5]:
arr.mean(axis=1)

array([2., 5., 8.])

In [6]:
arr.mean()

np.float64(5.0)

In [7]:
arr.var(axis=0)

array([6., 6., 6.])

In [8]:
arr.var(axis=1)

array([0.66666667, 0.66666667, 0.66666667])

In [9]:
arr.std(axis=0)

array([2.44948974, 2.44948974, 2.44948974])

In [10]:
arr.max(axis=0)

array([7, 8, 9])

In [11]:
arr.max(axis=1)

array([3, 6, 9])

In [12]:
arr.max()

np.int64(9)

In [13]:
arr.min(axis=1)

array([1, 4, 7])